app/controllers/images_controller.rb

SELECT "portfolios".* FROM "portfolios"
SELECT "sliders".* FROM "sliders"
SELECT "projects".* FROM "projects"
---
  def index
    @portfolios = Portfolio.all
    @sliders = Slider.all
    @projects = Project.all